pisoFoam_fluentMesh_Solution/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

//internalField   uniform (0 0 0);
internalField   uniform (0 1 0);

boundaryField
{

    INLET			//bottom
    {
	//type            fixedValue;
        //value           uniform (0 1 0);	//0.1 and 1 m/s        
        
        //type            zeroGradient;
	//type		pressureInletOutletVelocity;
	//value		uniform (0.1 0 0);
	//value           uniform (0 0 0);
	//type		outletInlet;
	//outletValue	uniform (1 0 0);
	
        type            fixedValue;
        value           $internalField;	
    }

    OUTLET			//top
    {
	    //type		pressureInletOutletVelocity;
	    //value		uniform (0 0 0);
        //type        zeroGradient;

        type            pressureInletOutletVelocity;
        value           $internalField;        
    }


    WALLS
    {
	    type		noSlip;
    }

    ROD
    {
	    type		noSlip;
    } 

/*
    top
    {
	//type		pressureInletOutletVelocity;
	//value		$internalField;	//uniform (0 0 0);
	type        	zeroGradient;
    }

    bottom
    {
	type            fixedValue;
//        value           uniform (0 1 0);	//0.1 and 1 m/s
        value           $internalField;	        
        
        //type            zeroGradient;
	//type		pressureInletOutletVelocity;
	//value		uniform (0.1 0 0);
	//value           uniform (0 0 0);
	//type		outletInlet;
	//outletValue	uniform (1 0 0);
    }

    left
    {
	type		noSlip;
    }

    right
    {
	type		noSlip;
    }

    front
    {
	type		noSlip;
    }

    back
    {
	type		noSlip;
    }

    //OneCylinderAtCenter
    Cylinder
    {
	type		noSlip;
    } 
*/           
}


// ************************************************************************* //
